linwuyen/workapsce_DB/Backup/1_MSPM0/M0G3507_Uart_ModbusRTU/Debug/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     80000000



/* Defines for SWTIMER */
#define SWTIMER_INST                                                     (TIMA0)
#define SWTIMER_INST_IRQHandler                                 TIMA0_IRQHandler
#define SWTIMER_INST_INT_IRQN                                   (TIMA0_INT_IRQn)
#define SWTIMER_INST_LOAD_VALUE                                         (39062U)



/* Defines for DEBUG_SCI */
#define DEBUG_SCI_INST                                                     UART0
#define DEBUG_SCI_INST_IRQHandler                               UART0_IRQHandler
#define DEBUG_SCI_INST_INT_IRQN                                   UART0_INT_IRQn
#define GPIO_DEBUG_SCI_RX_PORT                                             GPIOA
#define GPIO_DEBUG_SCI_TX_PORT                                             GPIOA
#define GPIO_DEBUG_SCI_RX_PIN                                      DL_GPIO_PIN_1
#define GPIO_DEBUG_SCI_TX_PIN                                      DL_GPIO_PIN_0
#define GPIO_DEBUG_SCI_IOMUX_RX                                   (IOMUX_PINCM2)
#define GPIO_DEBUG_SCI_IOMUX_TX                                   (IOMUX_PINCM1)
#define GPIO_DEBUG_SCI_IOMUX_RX_FUNC                    IOMUX_PINCM2_PF_UART0_RX
#define GPIO_DEBUG_SCI_IOMUX_TX_FUNC                    IOMUX_PINCM1_PF_UART0_TX
#define DEBUG_SCI_BAUD_RATE                                             (115200)
#define DEBUG_SCI_IBRD_40_MHZ_115200_BAUD                                   (21)
#define DEBUG_SCI_FBRD_40_MHZ_115200_BAUD                                   (45)





/* Port definition for Pin Group GPIO_LEDS */
#define GPIO_LEDS_PORT                                                   (GPIOA)

/* Defines for USER_TEST: GPIOA.15 with pinCMx 37 on package pin 18 */
#define GPIO_LEDS_USER_TEST_PIN                                 (DL_GPIO_PIN_15)
#define GPIO_LEDS_USER_TEST_IOMUX                                (IOMUX_PINCM37)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_SWTIMER_init(void);
void SYSCFG_DL_DEBUG_SCI_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
